{
    "majorRelease": 6,
    "minorRelease": 1,
    "pages": [
        {
            "content": "舄<span data-type=\"title\">(هذا نص التقرير) </span>\rالوارد من حضرة صاحب الفضيلة الأستاذ الأكبر الشيخ حسونة النواوي شيخ الجامع الأزهر - حفظه الله",
            "id": 1,
            "page": 1,
            "part": "المقدمة"
        },
        {
            "content": "舄﷽\rالحمد للَّه رفع منار السنة النبوية وأعلى مكانها، ووفق من اصطفاه من خلقه لخدمتها فشادوا بنيانها، والصلاة والسلام على المبعوث رحمة للعالمين، سيدنا محمد وعلى آله وصحبه أجمعين والتابعين لهم بإحسان إلى يوم الدين، أما بعد:\rفإن مولانا أمير المؤمنين وخليفة رسول رب العالمين سلطان البرين والبحرين وإمام الحرمين الشريفين، السلطان الأعظم والخاقان الأفخم السلطان ابن السلطان السلطان الغازي عبد الحميد خان الثاني - نصر اللَّه به الإسلام والمسلمين، وأيد بدوام شوكته الملة والدين، وأسعد بوجوده وجوده عموم رعاياه، وحف اللَّه بألطافه الصمدانية وعنايته الربانية ذاته الملوكانية الشاهانية، وعظمته وسلطته الهمايونية - قد تعلقت إرادته السنية العلية بأن يعمل بمقتضى سجاياه الطاهرة الزكية فيما يعود على السنة النبوية بالصلاح، وعلى ذاته الشريفة بالبركة والفلاح، ففكر - أيده اللَّه - في أجل خدمة يسديها للسنة النبوية الحنيفية، فلم ير - وفقه اللَّه - أكمل من نشر أحاديثها الشريفة على وجه يصح معه النقل ويرضاه العقل، وقد اختار - أجله اللَّه - من بين كتب الحديث المنيفة كتاب \"صحيح البخاري\"، الذي اشتهر بضبط الرواية عند أهل الدراية، فأمر - وأمره الموفق - بأن يطبع في مطبعة مصر الأميرية؛ لما اشتهرت به من دقة التصحيح، وجودة الحروف بين كل المطابع العربية، وبأن يكون طبع هذا الكتاب في هذه المطبعة على النسخة \"اليونينية\" المحفوظة في الخزانة الملوكية بالآستانة العلية؛ لما هي معروفة به من الصحة القليلة المثال في هذا الجيل وما مضى من الأجيال، وبأن يكون جميع ما يطبع من هذا الكتاب وقفا عامًّا لجميع الممالك الإسلامية، وبأن يتولى قراءة المطبوع بعد تصحيحه في المطبعة جمع من أكابر علماء الأزهر الأعلام، الذين لهم في خدمة الحديث الشريف قدم راسخة بين الأنام، وفي التاسع عشر من شهر رمضان المبارك من سنة ١٣١٢ للهجرة النبوية على صاحبها أفضل الصلاة وأزكى التحية، أبلغ صاحب الدولة الغازي أحمد مختار باشا المندوب العالي العثماني في القطر المصري هذه الأوامر السلطانية إلينا؛ لنجمع من حضرات أكابر العلماء الأزهريين من يعتمد عليهم في هذا الباب، ونقوم معهم بهذه الخدمة الشريفة والأعمال المنيفة، ثم بعث دولته إلينا بالنسخة \"اليونينية\"، والنسخ المطبوعة على يد صاحب السعادة عبد السلام باشا المويلحي؛ للمقابلة عليها، كما قضى بذلك الأمر الهمايوني الكريم، وقد كان، وجمعنا ستة عشر ممن عم فضلهم واشتهر، وأبلغناهم هذه الأوامر السلطانية، فتلقوها بصدور رحبة وأفئدة فرحة؛ لعلمهم أنها خدمة من أجل الخدم الدينية وأعظمها قدرًا وأكبرها نفعًا، خصوصًا وقد أمر بها جلالة سلطان المسلمين",
            "id": 2,
            "page": 2,
            "part": "المقدمة"
        },
        {
            "content": "舄وحافظ حوزة الدين، وأظهروا غاية القبول لهذا العمل المأمول، وعلى ذلك جمعنا أيضًا ما أمكن جمعه من نسخ هذا \"الصحيح\" القديمة، من المكاتب العامة والخاصة، مما عني به المتقدمون ضبطًا وتصحيحًا، وبدأنا مع حضراتهم في العمل بغاية الجد والاجتهاد، حتى تمت قراءته ومقابلته في مدة يسيرة من الزمان، مع بذل ما في الاستطاعة من العناية بضبط الحروف وشكلها وتحري أسماء الرواة وضبطها وأوجه الروايات، فجاء هذا الكتاب الجليل - بحمد اللَّه - على غاية ما يرام، مطابقًا لما أراده مولانا أمير المؤمنين، وحررنا جدولًا بما وجد من الخطأ وما بدل به من الصواب، وقد صارت هذه النسخة الجديدة التي طبعت بأمر مولانا أمير المؤمنين - أيده اللَّه - هي المعول عليها في الصحة والاعتبار، ولا ننسى في هذا المقام فضل الأفاضل المصححين بالمطبعة الأميرية؛ فإنهم بذلوا الوسع في المراجعة والتدقيق في التصحيح بما لا مزيد عليه، وإن شاء اللَّه تعالى يحصل بنشرها النفع العميم والخير العظيم، وتعود بركة ذلك النفع والخير إلى من هو السبب الأول فيه، وهو سيدنا ومولانا الخليفة الأعظم أمير المؤمنين الأفخم؛ فإن جلالته هو الآمر به والمسدي له، جزاه اللَّه عن الإسلام والمسلمين أعظم ما يجازى به إمام عدل في رعيته، وخدم شريعة سيد المرسلين ورفع منار سنته، ولا برحت أياديه البيضاء في خدمة السنة النبوية الغراء ما دام النيران وتعاقب الملوان، آمين.\r\rأما حضرات العلماء الأعلام الذين خدموا صحيح هذا الإمام فهم:\r• حضرة الأستاذ الشيخ سليم البشري شيخ السادة المالكية بالأزهر.\r• حضرة الأستاذ السيد علي الببلاوي من علماء السادة المالكية بالأزهر ونقيب السادة الأشراف بالديار المصرية.\r• حضرة الأستاذ الشيخ أحمد الرفاعي من علماء السادة المالكية بالأزهر وشيخ رواق السادة الفيمة بالأزهر.\r• حضرة الأستاذ الشيخ إسماعيل الحامدي من علماء السادة المالكية بالأزهر وشيخ رواق السادة الصعايدة بالأزهر.\r• حضرة الأستاذ الشيخ أحمد الجيزاوي من علماء السادة المالكية بالأزهر شيخ الجيزاوية بالأزهر.\r• حضرة الأستاذ الشيخ حسن داود العدوي من علماء السادة المالكية بالأزهر وإمام راتب بالجامع الأزهر.\r• حضرة الأستاذ الشيخ سليمان العبد من علماء السادة الشافعية بالأزهر.\r• حضرة الأستاذ الشيخ يوسف النابلسي شيخ السادة الحنابلة بالأزهر.\r• حضرة الأستاذ الشيخ بكري عاشور الصدفي من علماء السادة الحنفية بالأزهر مفتي بيت مال مصر والمجلس الحسبي.\r• حضرة الأستاذ الشيخ عمر الرافعي من علماء السادة الحنفية بالأزهر مفتي مديرية الجيزة.\r• حضرة الأستاذ الشيخ محمد حسين الإبريري من علماء السادة الشافعية.\r• حضرة الأستاذ الشيخ محمد أبو الفضل الوراقي من علماء السادة المالكية.\r• حضرة الأستاذ الشيخ هارون عبد الرازق من علماء السادة المالكية.\r• حضرة الأستاذ الشيخ حسن الطويل من علماء السادة المالكية.\r• حضرة الأستاذ الشيخ حمزة فتح اللَّه مفتش اللغة العربية بالمعارف المصرية.\r• حضرة السيد محمد غانم من أهل العلم الشافعية بالأزهر الذين لهم دراية بعلم الحديث.",
            "id": 3,
            "page": 3,
            "part": "المقدمة"
        },
        {
            "content": "舄هذا وقد احتفلنا بيوم ختام هذا الكتاب المستطاب في مركز إدارة الجامع الأزهر الأنور، فحضر في ذلك اليوم المشهود جمع من أكابر العلماء، وتليت الأدعية الصالحة المقبولة بدوام عرش الخلافة العظمى وتأييد مولانا أمير المؤمنين، وخطب فيها البعض من أكابرهم ببيان فضل هذا العمل وفضل الآمر به والعاملين فيه، واختتمناها بصالح الدعاء لسيدنا ومولانا أمير المؤمنين، وأمن جميع الحاضرين بقلوب سليمة، وأفئدة مليئة كلها محبة وولاء وصفاء لعرش الخلافة، خلد اللَّه ملك جلالة مولانا أمير المؤمنين فيه على الدوام، آمين.\rيوم الأحد ٢٠ صفر سنة ١٣١٣\rمحل الختم\rالفقير حسونة النواوي الحنفي\rخادم العلم والفقراء بالأزهر.\r\rوقد أنشأ هذه القصيدة والتاريخ حضرة العلامة الفاضل الشيخ سليمان العبد\r(أحد الأفاضل المشروحة أسماؤهم بالتقرير)\rإِنْ رُمْتَ تَحْظَى بِالْقَبُو … لِ وتَرْتَقِي الشَّرَفَ الوَطِيدْ\rفَالْزَمْ صَحِيحًا لِلْبُخَا … رِي تَكْتَسِي العِزَّ المَدِيدْ\rواحْمَدْ أَمِيرَ المؤمِنيـ … ـنَ وَفَضْلَه الفَضْلَ المَزِيدْ\rشَادَ الشَّرِيعَةَ فِي الأَنَا … مِ فَلَا يَزَالُ لَهَا يَشِيدْ\rأَحْيَا لِسُنَّة خَيرِ خَلْـ … ــقِ اللَّهِ لِلْحُسْنَى يُرِيدْ\rعَاشَ الْخَلِيفَةُ سَالمًا … وَلَنَا بِهِ النُّعْمَى تَزِيدْ\rطُبِعَ البُخَارِيُّ طَبَعَةً … فَاقَتْ عَلَى الدُّرِّ النَّضِيدْ\rوَأَفَاضَهَا وَقْفًا عَلَى … مَنْ يَسْتَفِيدُ وَمَنْ يُفِيدْ\rفَنَظَمْتُ نَظْمًا قَدْ حَوَى التَّـ … ـارِيخَ فِي بَيْتِ الْقَصِيدْ\rطَبَعَ البُخَارِيَّ جَيِّدًا … سُلْطَانُنَا عَبْدُ الحَميدْ\r٨١، ٨٤٤، ١٨، ٢٠١، ١٦٩\r\rسنة ١٣١٣",
            "id": 4,
            "page": 4,
            "part": "المقدمة"
        },
        {
            "content": "舄<span data-type=\"title\">مقدمة </span>\r﷽\r\rيا من أمر بصنع الجميل، وجزى عليه الجزاء الجزيل، نحمدك على ما هديتنا، ونشكرك على ما أوليتنا، ونصلي ونسلم على نبيك الأكرم، ورسولك السيد السند الأعظم، سيدنا ومولانا محمد الذي كان أسرع إلى الخير من الريح المرسلة، وعلى آله وصحبه وكل من والى المعروف وواصله، أما بعد:\rفإن من المآثر العظام والأيادي الجسام التي لا يزال يسديها إلى أمة الإسلام سيدنا ومولانا أمير المؤمنين، وخليفة أشرف الأنبياء والمرسلين، القائم بحياطة الدين وإصلاح أمر العالمين، صاحب الرأفة الشاملة العامة، والإحسانات الجمة التامة، والرحمة التي يرتاح لها كل قوي وضعيف، والهمة العليا التي تنيل كل أحد حاجته من وضيع وشريف، سلطان البرين والبحرين، وخادم الحرمين الشريفين، ظل اللَّه على رعيته، ونعمته الشاملة لبريته، مولانا الإمام العدل المجاهد السلطان ابن السلطان السلطان الغازي عبد الحميد خان الثاني ابن السلطان عبد المجيد خان، أيد اللَّه",
            "id": 5,
            "page": 2,
            "part": "1"
        },
        {
            "content": "舄القسط بهمته، وقوم أود الرعية بعدالته، وأكثر خير البلاد بيمنه، وأنام جميع الأنام في ظل أمنه، وأدامه عزًّا للإسلام، ورحمة لجميع الأنام.\rأنه - قوى اللَّه شوكته - أصدر أمره الكريم الشاهاني في سنة ١٣١١ من هجرته ﷺ بطبع الكتاب الجليل الشان، الغني بشهرة نفعه عن الإطراء والبيان، وهو \"صحيح الإمام أبي عبد اللَّه محمد بن إسماعيل البخاري\" ﵁ وأرضاه، وأن يعتمد في تصحيحه على نسخة شديدة الضبط بالغة الصحة، من فروع النسخة \"اليونينية\" المعول عليها في جميع روايات \"صحيح البخاري\" الشريف، وعلى نسخ أخرى خلافها شهيرة الصحة والضبط، وأن تكون نسخه المطبوعة كلها وقفًا على الخاص والعام، من سائر المسلمين شرقًا وغربًا، عجمًا وعربًا.\rوحقيقة أصل \"اليونينية\" أن شيخ الإسلام الإمام جمال الدين محمد بن مالك لما هاجر من الأندلس واستقر بدمشق، طلب منه فضلاء المحدثين والحفاظ أن يوضح ويصحح لهم مشكلات ألفاظ روايات \"صحيح البخاري\"، فأجابهم إلى ذلك، ووضحها وصححها لهم في أحد وسبعين مجلسًا، وألف لهم \"شواهد التوضيح والتصحيح لمشكلات الجامع الصحيح\"، وكتب عند تمام ختم التصحيح على أول ورقة من الجزء الأخير من النسخة \"اليونينية\" المذكورة ما صورته:\rسمعت ما تضمنه هذا المجلد من \"صحيح البخاري\" ﵁ بقراءة سيدنا الشيخ الإمام العالم الحافظ المتقن شرف الدين أبي الحسين علي بن محمد بن أحمد اليونيني ﵁ وعن سلفه، وكان السماع بحضرة جماعة من الفضلاء ناظرين في نسخ معتمد عليها، فكلما مر بهم لفظ ذو إشكال بينت فيه الصواب، وضبط على ما اقتضاه علمي بالعربية، وما افتقر إلى بسط عبارة وإقامة دلالة أخرت أمره إلى جزء أستوفي فيه الكلام مما يحتاج إليه من نظير وشاهد؛ ليكون الانتفاع به عامًّا، والبيان تامًّا، إن شاء اللَّه تعالى. وكتبه محمد بن عبد اللَّه بن مالك حامدًا للَّه تعالى. اهـ.\rوكتب الحافظ اليونيني على ظهر آخر ورقة من المجلد المذكور ما صورته:\rبلغت مقابلة وتصحيحًا وإسماعًا بين يدي شيخنا شيخ الإسلام حجة العرب، مالك أزمة الأدب، العلامة أبي عبد اللَّه بن مالك الطائي الجياني، أمد اللَّه تعالى عمره، في المجلس الحادي والسبعين، وهو يراعي قراءتي ويلاحظ نطقي، فما اختاره ورجحه وأمر بإصلاحه أصلحته وصححت عليه،",
            "id": 6,
            "page": 3,
            "part": "1"
        },
        {
            "content": "舄وما ذكر أنه يجوز فيه إعرابان أو ثلاثة كتبت عليه: (معًا)، فأعملت ذلك على ما أمر ورجح، وأنا أقابل بأصل الحافظ أبي ذر، والحافظ أبي محمد الأصيلي، والحافظ أبي القاسم الدمشقي ما خلا الجزء الثالث عشر والثالث والثلاثين؛ فإنهما معدومان، وبأصل مسموع على الشيخ أبي الوقت بقراءة الحافظ أبي منصور السمعاني وغيره من الحفاظ، وهو وقف بخانقاه السميساطي، وعلامات ما وافقت أبا ذر هـ والأصيلي ص والدمشقي ش وأبا الوقت ظ؛ فليعلم ذلك، وقد ذكرت ذلك في أول الكتاب في فرخة؛ لتعلم الرموز. كتبه علي بن محمد الهاشمي اليونيني عفا اللَّه عنه. اهـ.\rفشكر اللَّه لسيدنا ومولانا أمير المؤمنين هذه الإرادة الجميلة، وتقبل منه هذه الخيرات العميمة الجزيلة، وأطال اللَّه حياته عصمة لجميع المسلمين، وحياطة لعموم العالمين، بجاه سيد الأولين والآخرين، صلى اللَّه وسلم عليه وعلى آله وصحبه أجمعين، وسلام على جميع الأنبياء والمرسلين وآلهم، والحمد للَّه رب العالمين.\r\rاعلم أن البخاري رضي اللَّه تعالى عنه ولد ببخارى يوم الجمعة أو ليلتها ثالث عشر شوال سنة ١٩٤ وتوفي ليلة السبت ليلة عيد الفطر سنة ٢٥٦ عن اثنتين وستين سنة إلا ثلاثة عشر يومًا، روي عنه أنه قال: خرجت كتاب \"الصحيح\" من زهاء ستمائة ألف حديث في ست عشرة سنة، وما وضعت فيه حديثًا إلا اغتسلت وصليت ركعتين. اهـ. وفضائله أكثر من أن تحصى، وأوفر من عدد الرمل والحصى، وعدد أحاديث صحيحه سبعة آلاف ومائتان وخمسة وسبعون، وبإسقاط المكرر أربعة آلاف، وقيل غير ذلك، وقد تنازع البخاري المذاهب الأربعة، والصحيح أنه مجتهد. اهـ من \"شرح الشبرخيتي على الأربعين النووية\"، ومن غيره.",
            "id": 7,
            "page": 4,
            "part": "1"
        },
        {
            "content": "舄 (الجزء الأول)\rمن صحيح أبي عبد اللَّه محمد بن إسماعيل بن إبراهيم بن المغيرة ابن بردزبه البخاري الجعفي رضي اللَّه تعالى عنه ونفعنا به آمين.\r\rقد وجدنا في النسخ الصحيحة المعتمدة التي صححنا عليها هذا المطبوع رموزًا لأسماء الرواة منها:\rهـ لأبي ذر الهروي، وص للأصيلي، وس لابن عساكر، وط لأبي الوقت، وهـ للكشميهني، وحـ للحموي، وسـ للمستملي، وك لكريمة، وحهـ لاجتماع الحموي والكشميهني، وحسـ للحموي والمستملي، وتارة توجد تحت حهـ وحسـ هـ أو غيرها إشارة إلى روايته عنهما، وتارة توجد قبل الرمز (لا) إشارة إلى سقوط الكلمة الموضوعة عليها (لا) عند أصحاب الرمز الذي بعدها، وقد يوجد في آخر تلك الجملة التي عليها (لا) لفظ (إلى) إشارة إلى آخر الساقط عند صاحب الرمز.\rومن الرموز ع ولعلها لابن السمعاني، وج ولعلها للجرجاني، وق ولعلها للقابسي، وح وعط وصع ولم يعلم أصحابها، وربما وجد رموز غير ذلك لم تعلم أيضًا، ويوجد على بعض الكلمات خـ أو ـخـ أو خ وهي إشارة إلى أنها نسخة أخرى، وقد يوجد على الكلمة لفظ صحـ إشارة إلى صحة سماع هذه الكلمة عند المرموز له أو عند الحافظ اليونيني. واللَّه سبحانه أعلم.\r\r(طبع)\rبالمطبعة الكبرى الأميرية ببولاق مصر المحمية\rسنة ١٣١١ هجرية",
            "id": 8,
            "page": 5,
            "part": "1"
        },
        {
            "content": "﷽\rقَالَ الشَّيْخُ الإِمَامُ الْحَافِظُ أَبُو عَبْدِ اللَّهِ مُحَمَّدُ بْنُ إِسْمَاعِيلَ بْنِ إِبْرَاهِيمَ بْنِ الْمُغِيرَةِ الْبُخَارِىُّ رَحِمَهُ اللَّهُ تَعَالَى، آمِينَ: كَيْفَ كَانَ بَدْءُ الْوَحْيِ إِلَى رَسُولِ اللهِ ﷺ، وَقَوْلُ اللهِ جَلَّ ذِكْرُهُ: ﴿إِنَّا أَوْحَيْنَا إِلَيْكَ كَمَا أَوْحَيْنَا إِلَى نُوحٍ وَالنَّبِيِّينَ مِنْ بَعْدِهِ﴾.\r<span id=\"link-1\"> </span>",
            "id": 9,
            "page": 6,
            "part": "1"
        },
        {
            "content": "١ - حَدَّثَنَا <a href=\"inr://man-3654\">الْحُمَيْدِيُّ عَبْدُ اللهِ بْنُ الزُّبَيْرِ </a>،  قَالَ: حَدَّثَنَا <a href=\"inr://man-2478\">سُفْيَانُ </a>،  قَالَ: حَدَّثَنَا <a href=\"inr://man-6932\">يَحْيَى بْنُ سَعِيدٍ الْأَنْصَارِيُّ </a>،  قَالَ: أَخْبَرَنِي <a href=\"inr://man-5443\">مُحَمَّدُ بْنُ إِبْرَاهِيمَ التَّيْمِيُّ </a>:  أَنَّهُ سَمِعَ <a href=\"inr://man-4494\">عَلْقَمَةَ بْنَ وَقَّاصٍ اللَّيْثِيَّ </a>،  يَقُولُ: سَمِعْتُ <a href=\"inr://man-4677\">عُمَرَ بْنَ الْخَطَّابِ </a>﵁ عَلَى الْمِنْبَرِ، قَالَ: سَمِعْتُ رَسُولَ اللهِ ﷺ، يَقُولُ: <hadeeth-1>«إِنَّمَا الْأَعْمَالُ بِالنِّيَّاتِ، وَإِنَّمَا لِكُلِّ امْرِئٍ مَا نَوَى، فَمَنْ كَانَتْ هِجْرَتُهُ إِلَى دُنْيَا يُصِيبُهَا، أَوْ إِلَى امْرَأَةٍ يَنْكِحُهَا، فَهِجْرَتُهُ إِلَى مَا هَاجَرَ إِلَيْهِ».\r <hadeeth>",
            "id": 10,
            "number": "1",
            "page": 6,
            "part": "1"
        },
        {
            "content": "٢ - حَدَّثَنَا <a href=\"inr://man-3997\">عَبْدُ اللهِ بْنُ يُوسُفَ </a>،  قَالَ: أَخْبَرَنَا <a href=\"inr://man-5361\">مَالِكٌ، </a>عَنْ <a href=\"inr://man-6702\">هِشَامِ بْنِ عُرْوَةَ، </a>عَنْ <a href=\"inr://man-4361\">أَبِيهِ، </a>عَنْ <a href=\"inr://man-3026\">عَائِشَةَ </a>أُمِّ الْمُؤْمِنِينَ ﵂: <hadeeth-2>«أَنَّ الْحَارِثَ بْنَ هِشَامٍ ﵁ سَأَلَ رَسُولَ اللهِ ﷺ فَقَالَ: يَا رَسُولَ اللهِ، كَيْفَ يَأْتِيكَ الْوَحْيُ؟ فَقَالَ رَسُولُ اللهِ ﷺ: أَحْيَانًا يَأْتِينِي مِثْلَ صَلْصَلَةِ الْجَرَسِ، وَهُوَ أَشَدُّهُ عَلَيَّ، فَيُفْصَمُ عَنِّي وَقَدْ وَعَيْتُ عَنْهُ مَا قَالَ، وَأَحْيَانًا يَتَمَثَّلُ لِيَ الْمَلَكُ رَجُلًا، فَيُكَلِّمُنِي فَأَعِي مَا يَقُولُ.\r\r⦗٧⦘\rقَالَتْ عَائِشَةُ ﵂: وَلَقَدْ رَأَيْتُهُ يَنْزِلُ عَلَيْهِ الْوَحْيُ فِي الْيَوْمِ الشَّدِيدِ الْبَرْدِ، فَيَفْصِمُ عَنْهُ وَإِنَّ جَبِينَهُ لَيَتَفَصَّدُ عَرَقًا».\r <hadeeth>",
            "id": 11,
            "number": "2",
            "page": 6,
            "part": "1"
        },
        {
            "content": "<span data-type='title' id=toc-13>بَابٌ: حُبُّ الرَّسُولِ ﷺ مِنَ الْإِيمَانِ</span>",
            "id": 30,
            "page": 12,
            "part": "1"
        },
        {
            "content": "١٤ - حَدَّثَنَا <a href=\"inr://man-1588\">أَبُو الْيَمَانِ </a>قَالَ: أَخْبَرَنَا <a href=\"inr://man-2785\">شُعَيْبٌ </a>قَالَ: حَدَّثَنَا <a href=\"inr://man-3645\">أَبُو الزِّنَادِ، </a>عَنِ <a href=\"inr://man-3424\">الْأَعْرَجِ، </a>عَنْ <a href=\"inr://man-3320\">أَبِي هُرَيْرَةَ </a>﵁: أَنَّ رَسُولَ اللهِ ﷺ قَالَ: <hadeeth-14>«فَوَالَّذِي نَفْسِي بِيَدِهِ لَا يُؤْمِنُ أَحَدُكُمْ حَتَّى أَكُونَ أَحَبَّ إِلَيْهِ مِنْ وَالِدِهِ وَوَلَدِهِ».\r <hadeeth>",
            "id": 31,
            "number": "14",
            "page": 12,
            "part": "1"
        },
        {
            "content": "١٥ - حَدَّثَنَا <a href=\"inr://man-7150\">يَعْقُوبُ بْنُ إِبْرَاهِيمَ </a>قَالَ: حَدَّثَنَا <a href=\"inr://man-634\">ابْنُ عُلَيَّةَ، </a>عَنْ <a href=\"inr://man-3479\">عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ، </a>عَنْ <a href=\"inr://man-822\">أَنَسٍ، </a>عَنِ النَّبِيِّ ﷺ (ح). وَحَدَّثَنَا <a href=\"inr://man-3\">آدَمُ </a>قَالَ: حَدَّثَنَا <a href=\"inr://man-2779\">شُعْبَةُ، </a>عَنْ <a href=\"inr://man-5183\">قَتَادَةَ، </a>عَنْ <a href=\"inr://man-822\">أَنَسٍ </a>قَالَ: قَالَ النَّبِيُّ ﷺ: <hadeeth-15>«لَا يُؤْمِنُ أَحَدُكُمْ حَتَّى أَكُونَ أَحَبَّ إِلَيْهِ مِنْ وَالِدِهِ وَوَلَدِهِ وَالنَّاسِ أَجْمَعِينَ».\r <hadeeth>",
            "id": 32,
            "number": "15",
            "page": 12,
            "part": "1"
        },
        {
            "content": "<span data-type='title' id=toc-14>بَابُ حَلَاوَةِ الْإِيمَانِ</span>",
            "id": 33,
            "page": 12,
            "part": "1"
        },
        {
            "content": "١٦ - حَدَّثَنَا <a href=\"inr://man-5898\">مُحَمَّدُ بْنُ الْمُثَنَّى </a>قَالَ: حَدَّثَنَا <a href=\"inr://man-4085\">عَبْدُ الْوَهَّابِ الثَّقَفِيُّ </a>قَالَ: حَدَّثَنَا <a href=\"inr://man-857\">أَيُّوبُ، </a>عَنْ <a href=\"inr://man-3667\">أَبِي قِلَابَةَ، </a>عَنْ <a href=\"inr://man-822\">أَنَسٍ، </a>عَنِ النَّبِيِّ ﷺ قَالَ: <hadeeth-16>«ثَلَاثٌ مَنْ كُنَّ فِيهِ وَجَدَ حَلَاوَةَ الْإِيمَانِ: أَنْ يَكُونَ اللهُ وَرَسُولُهُ أَحَبَّ إِلَيْهِ مِمَّا سِوَاهُمَا، وَأَنْ يُحِبَّ الْمَرْءَ لَا يُحِبُّهُ إِلَّا لِلهِ، وَأَنْ يَكْرَهَ أَنْ يَعُودَ فِي الْكُفْرِ كَمَا يَكْرَهُ أَنْ يُقْذَفَ فِي النَّارِ».\r <hadeeth>",
            "id": 34,
            "number": "16",
            "page": 12,
            "part": "1"
        },
        {
            "content": "<span data-type='title' id=toc-15>بَابٌ: عَلَامَةُ الْإِيمَانِ حُبُّ الْأَنْصَارِ</span>",
            "id": 35,
            "page": 12,
            "part": "1"
        },
        {
            "content": "١٧ - حَدَّثَنَا <a href=\"inr://man-6700\">أَبُو الْوَلِيدِ </a>قَالَ: حَدَّثَنَا <a href=\"inr://man-2779\">شُعْبَةُ </a>قَالَ: أَخْبَرَنِي <a href=\"inr://man-3764\">عَبْدُ اللهِ بْنُ عَبْدِ اللهِ بْنِ جَبْرٍ </a>قَالَ: سَمِعْتُ <a href=\"inr://man-822\">أَنَسًا، </a>عَنِ النَّبِيِّ ﷺ قَالَ: <hadeeth-17>«آيَةُ الْإِيمَانِ حُبُّ الْأَنْصَارِ، وَآيَةُ النِّفَاقِ بُغْضُ الْأَنْصَارِ.»\r <hadeeth>",
            "id": 36,
            "number": "17",
            "page": 12,
            "part": "1"
        },
        {
            "content": "<span data-type='title' id=toc-16>بَابٌ</span>",
            "id": 37,
            "page": 12,
            "part": "1"
        },
        {
            "content": "١٨ - حَدَّثَنَا <a href=\"inr://man-1588\">أَبُو الْيَمَانِ </a>قَالَ: أَخْبَرَنَا <a href=\"inr://man-2785\">شُعَيْبٌ، </a>عَنِ <a href=\"inr://man-5917\">الزُّهْرِيِّ </a>قَالَ: أَخْبَرَنِي <a href=\"inr://man-3024\">أَبُو إِدْرِيسَ عَائِذُ اللهِ بْنُ عَبْدِ اللهِ: </a>أَنَّ <a href=\"inr://man-3120\">عُبَادَةَ بْنَ الصَّامِتِ </a>﵁، وَكَانَ شَهِدَ بَدْرًا، وَهُوَ أَحَدُ النُّقَبَاءِ لَيْلَةَ الْعَقَبَةِ: <hadeeth-18>«أَنَّ رَسُولَ اللهِ ﷺ قَالَ، وَحَوْلَهُ عِصَابَةٌ مِنْ أَصْحَابِهِ: بَايِعُونِي عَلَى أَلَّا تُشْرِكُوا بِاللهِ شَيْئًا، وَلَا تَسْرِقُوا، وَلَا تَزْنُوا، وَلَا تَقْتُلُوا أَوْلَادَكُمْ،\r\r⦗١٣⦘\rوَلَا تَأْتُوا بِبُهْتَانٍ تَفْتَرُونَهُ بَيْنَ أَيْدِيكُمْ وَأَرْجُلِكُمْ، وَلَا تَعْصُوا فِي مَعْرُوفٍ، فَمَنْ وَفَى مِنْكُمْ فَأَجْرُهُ عَلَى اللهِ، وَمَنْ أَصَابَ مِنْ ذَلِكَ شَيْئًا فَعُوقِبَ فِي الدُّنْيَا فَهُوَ كَفَّارَةٌ لَهُ، وَمَنْ أَصَابَ مِنْ ذَلِكَ شَيْئًا ثُمَّ سَتَرَهُ اللهُ فَهُوَ إِلَى اللهِ، إِنْ شَاءَ عَفَا عَنْهُ وَإِنْ شَاءَ عَاقَبَهُ. فَبَايَعْنَاهُ عَلَى ذَلِكَ».\r <hadeeth>",
            "id": 38,
            "number": "18",
            "page": 12,
            "part": "1"
        },
        {
            "content": "<span data-type='title' id=toc-17>بَابٌ: مِنَ الدِّينِ الْفِرَارُ مِنَ الْفِتَنِ</span>",
            "id": 39,
            "page": 13,
            "part": "1"
        },
        {
            "content": "١٩ - حَدَّثَنَا <a href=\"inr://man-3919\">عَبْدُ اللهِ بْنُ مَسْلَمَةَ، </a>عَنْ <a href=\"inr://man-5361\">مَالِكٍ، </a>عَنْ <a href=\"inr://man-3350\">عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي صَعْصَعَةَ، </a>عَنْ <a href=\"inr://man-3739\">أَبِيهِ، </a>عَنْ <a href=\"inr://man-2313\">أَبِي سَعِيدٍ الْخُدْرِيِّ </a>أَنَّهُ قَالَ: قَالَ رَسُولُ اللهِ ﷺ: <hadeeth-19>«يُوشِكُ أَنْ يَكُونَ خَيْرَ مَالِ الْمُسْلِمِ غَنَمٌ يَتْبَعُ بِهَا شَعَفَ الْجِبَالِ وَمَوَاقِعَ الْقَطْرِ، يَفِرُّ بِدِينِهِ مِنَ الْفِتَنِ».\r <hadeeth>",
            "id": 40,
            "number": "19",
            "page": 13,
            "part": "1"
        },
        {
            "content": "<span data-type='title' id=toc-18>بَابُ قَوْلُِ النَّبِيِّ ﷺ أَنَا أَعْلَمُكُمْ بِاللهِ </span>وَأَنَّ الْمَعْرِفَةَ فِعْلُ الْقَلْبِ لِقَوْلِ اللهِ تَعَالَى ﴿وَلَكِنْ يُؤَاخِذُكُمْ بِمَا كَسَبَتْ قُلُوبُكُمْ﴾",
            "id": 41,
            "page": 13,
            "part": "1"
        },
        {
            "content": "٢٠ - حَدَّثَنَا <a href=\"inr://man-5638\">مُحَمَّدُ بْنُ سَلَامٍ </a>قَالَ: أَخْبَرَنَا <a href=\"inr://man-4092\">عَبْدَةُ، </a>عَنْ <a href=\"inr://man-6702\">هِشَامٍ، </a>عَنْ <a href=\"inr://man-4361\">أَبِيهِ، </a>عَنْ <a href=\"inr://man-3026\">عَائِشَةَ </a>قَالَتْ: <hadeeth-20>«كَانَ رَسُولُ اللهِ ﷺ إِذَا أَمَرَهُمْ أَمَرَهُمْ مِنَ الْأَعْمَالِ بِمَا يُطِيقُونَ، قَالُوا: إِنَّا لَسْنَا كَهَيْئَتِكَ يَا رَسُولَ اللهِ، إِنَّ اللهَ قَدْ غَفَرَ لَكَ مَا تَقَدَّمَ مِنْ ذَنْبِكَ وَمَا تَأَخَّرَ، فَيَغْضَبُ حَتَّى يُعْرَفَ الْغَضَبُ فِي وَجْهِهِ، ثُمَّ يَقُولُ: إِنَّ أَتْقَاكُمْ وَأَعْلَمَكُمْ بِاللهِ أَنَا».\r <hadeeth>",
            "id": 42,
            "number": "20",
            "page": 13,
            "part": "1"
        },
        {
            "content": "<span data-type='title' id=toc-19>بَابٌ: مَنْ كَرِهَ أَنْ يَعُودَ فِي الْكُفْرِ كَمَا يَكْرَهُ أَنْ يُلْقَى فِي النَّارِ مِنَ الْإِيمَانِ</span>",
            "id": 43,
            "page": 13,
            "part": "1"
        },
        {
            "content": "٢١ - حَدَّثَنَا <a href=\"inr://man-2587\">سُلَيْمَانُ بْنُ حَرْبٍ </a>قَالَ: حَدَّثَنَا <a href=\"inr://man-2779\">شُعْبَةُ، </a>عَنْ <a href=\"inr://man-5183\">قَتَادَةَ، </a>عَنْ <a href=\"inr://man-822\">أَنَسٍ </a>﵁، عَنِ النَّبِيِّ ﷺ قَالَ: <hadeeth-16>«ثَلَاثٌ مَنْ كُنَّ فِيهِ وَجَدَ حَلَاوَةَ الْإِيمَانِ: مَنْ كَانَ اللهُ وَرَسُولُهُ أَحَبَّ إِلَيْهِ مِمَّا سِوَاهُمَا، وَمَنْ أَحَبَّ عَبْدًا لَا يُحِبُّهُ إِلَّا لِلهِ، وَمَنْ يَكْرَهُ أَنْ يَعُودَ فِي الْكُفْرِ - بَعْدَ إِذْ أَنْقَذَهُ اللهُ - كَمَا يَكْرَهُ أَنْ يُلْقَى فِي النَّارِ».\r <hadeeth>",
            "id": 44,
            "number": "21",
            "page": 13,
            "part": "1"
        },
        {
            "content": "<span data-type='title' id=toc-20>بَابُ تَفَاضُلِ أَهْلِ الْإِيمَانِ فِي الْأَعْمَالِ</span>",
            "id": 45,
            "page": 13,
            "part": "1"
        },
        {
            "content": "٢٢ - حَدَّثَنَا <a href=\"inr://man-676\">إِسْمَاعِيلُ </a>قَالَ: حَدَّثَنِي <a href=\"inr://man-5361\">مَالِكٌ، </a>عَنْ <a href=\"inr://man-4918\">عَمْرِو بْنِ يَحْيَى الْمَازِنِيِّ، </a>عَنْ <a href=\"inr://man-6974\">أَبِيهِ، </a>عَنْ <a href=\"inr://man-2313\">أَبِي سَعِيدٍ الْخُدْرِيِّ </a>﵁، عَنِ النَّبِيِّ ﷺ قَالَ: <hadeeth-21>«يَدْخُلُ أَهْلُ الْجَنَّةِ الْجَنَّةَ، وَأَهْلُ النَّارِ النَّارَ، ثُمَّ يَقُولُ اللهُ تَعَالَى: أَخْرِجُوا مَنْ كَانَ فِي قَلْبِهِ مِثْقَالُ حَبَّةٍ مِنْ خَرْدَلٍ مِنْ إِيمَانٍ. فَيُخْرَجُونَ مِنْهَا قَدِ اسْوَدُّوا، فَيُلْقَوْنَ فِي نَهَرِ الْحَيَا أَوِ الْحَيَاةِ - شَكَّ مَالِكٌ - فَيَنْبُتُونَ كَمَا تَنْبُتُ الْحِبَّةُ فِي جَانِبِ السَّيْلِ، أَلَمْ تَرَ أَنَّهَا تَخْرُجُ صَفْرَاءَ مُلْتَوِيَةً»\rقَالَ وُهَيْبٌ: حَدَّثَنَا عَمْرٌو: الْحَيَاةِ، وَقَالَ: خَرْدَلٍ مِنْ خَيْرٍ.\r <hadeeth>",
            "id": 46,
            "number": "22",
            "page": 13,
            "part": "1"
        },
        {
            "content": "٢٣ - حَدَّثَنَا <a href=\"inr://man-5799\">مُحَمَّدُ بْنُ عُبَيْدِ اللهِ </a>قَالَ: حَدَّثَنَا <a href=\"inr://man-50\">إِبْرَاهِيمُ بْنُ سَعْدٍ، </a>عَنْ <a href=\"inr://man-2863\">صَالِحٍ، </a>عَنِ <a href=\"inr://man-5917\">ابْنِ شِهَابٍ، </a>عَنْ <a href=\"inr://man-612\">أَبِي أُمَامَةَ بْنِ سَهْلٍ: </a>أَنَّهُ سَمِعَ <a href=\"inr://man-2313\">أَبَا سَعِيدٍ الْخُدْرِيَّ </a>يَقُولُ: قَالَ رَسُولُ اللهِ ﷺ: <hadeeth-22>«بَيْنَا أَنَا نَائِمٌ، رَأَيْتُ النَّاسَ يُعْرَضُونَ عَلَيَّ وَعَلَيْهِمْ قُمُصٌ، مِنْهَا مَا يَبْلُغُ الثُّدِيَّ، وَمِنْهَا مَا دُونَ ذَلِكَ، وَعُرِضَ\r\r⦗١٤⦘\rعَلَيَّ عُمَرُ بْنُ الْخَطَّابِ وَعَلَيْهِ قَمِيصٌ يَجُرُّهُ. قَالُوا: فَمَا أَوَّلْتَ ذَلِكَ يَا رَسُولَ اللهِ؟ قَالَ: الدِّينَ».\r <hadeeth>",
            "id": 47,
            "number": "23",
            "page": 13,
            "part": "1"
        },
        {
            "content": "<span data-type='title' id=toc-21>بَابٌ: الْحَيَاءُ مِنَ الْإِيمَانِ</span>",
            "id": 48,
            "page": 14,
            "part": "1"
        },
        {
            "content": "٢٤ - حَدَّثَنَا <a href=\"inr://man-3997\">عَبْدُ اللهِ بْنُ يُوسُفَ </a>قَالَ: أَخْبَرَنَا <a href=\"inr://man-5361\">مَالِكُ بْنُ أَنَسٍ، </a>عَنِ <a href=\"inr://man-5917\">ابْنِ شِهَابٍ، </a>عَنْ <a href=\"inr://man-2249\">سَالِمِ بْنِ عَبْدِ اللهِ، </a>عَنْ <a href=\"inr://man-3807\">أَبِيهِ </a>: <hadeeth-23>«أَنَّ رَسُولَ اللهِ ﷺ مَرَّ عَلَى رَجُلٍ مِنَ الْأَنْصَارِ وَهُوَ يَعِظُ أَخَاهُ فِي الْحَيَاءِ، فَقَالَ رَسُولُ اللهِ ﷺ: دَعْهُ فَإِنَّ الْحَيَاءَ مِنَ الْإِيمَانِ».\r <hadeeth>",
            "id": 49,
            "number": "24",
            "page": 14,
            "part": "1"
        },
        {
            "content": "<span data-type='title' id=toc-2828>بَابُ تَأْلِيفِ الْقُرْآنِ</span>",
            "id": 7442,
            "page": 185,
            "part": "6"
        },
        {
            "content": "٤٩٩٣ - حَدَّثَنَا <a href=\"inr://man-118\">إِبْرَاهِيمُ بْنُ مُوسَى، </a>أَخْبَرَنَا <a href=\"inr://man-6707\">هِشَامُ بْنُ يُوسُفَ: </a>أَنَّ <a href=\"inr://man-4035\">ابْنَ جُرَيْجٍ </a>أَخْبَرَهُمْ قَالَ: وَأَخْبَرَنِي <a href=\"inr://man-7214\">يُوسُفُ بْنُ مَاهَكٍ </a>قَالَ: <hadeeth-1948>«إِنِّي عِنْدَ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ ﵂ إِذْ جَاءَهَا عِرَاقِيٌّ فَقَالَ: أَيُّ الْكَفَنِ خَيْرٌ؟ قَالَتْ: وَيْحَكَ وَمَا يَضُرُّكَ. قَالَ: يَا أُمَّ الْمُؤْمِنِينَ أَرِينِي مُصْحَفَكِ، قَالَتْ: لِمَ؟ قَالَ: لَعَلِّي أُوَلِّفُ الْقُرْآنَ عَلَيْهِ، فَإِنَّهُ يُقْرَأُ غَيْرَ مُؤَلَّفٍ، قَالَتْ: وَمَا يَضُرُّكَ أَيَّهُ قَرَأْتَ قَبْلُ، إِنَّمَا نَزَلَ أَوَّلَ مَا نَزَلَ مِنْهُ سُورَةٌ مِنَ الْمُفَصَّلِ، فِيهَا ذِكْرُ الْجَنَّةِ وَالنَّارِ، حَتَّى إِذَا ثَابَ النَّاسُ إِلَى الْإِسْلَامِ نَزَلَ الْحَلَالُ وَالْحَرَامُ، وَلَوْ نَزَلَ أَوَّلَ شَيْءٍ: لَا تَشْرَبُوا الْخَمْرَ، لَقَالُوا: لَا نَدَعُ الْخَمْرَ أَبَدًا، وَلَوْ نَزَلَ: لَا تَزْنُوا، لَقَالُوا: لَا نَدَعُ الزِّنَا أَبَدًا، لَقَدْ نَزَلَ بِمَكَّةَ عَلَى مُحَمَّدٍ ﷺ وَإِنِّي لَجَارِيَةٌ أَلْعَبُ: ﴿بَلِ السَّاعَةُ مَوْعِدُهُمْ وَالسَّاعَةُ أَدْهَى وَأَمَرُّ﴾ وَمَا نَزَلَتْ سُورَةُ الْبَقَرَةِ وَالنِّسَاءِ إِلَّا وَأَنَا عِنْدَهُ، قَالَ: فَأَخْرَجَتْ لَهُ الْمُصْحَفَ، فَأمَْلَّتِْ عَلَيْهِ آيَ السُّورَةِ».\r <hadeeth>",
            "id": 7443,
            "number": "4993",
            "page": 185,
            "part": "6"
        },
        {
            "content": "بَابُ قَوْلِ اللهِ تَعَالَى ﴿فَاقْرَؤُوا مَا تَيَسَّرَ مِنَ الْقُرْآنِ﴾",
            "id": 11189,
            "page": 159,
            "part": "9"
        },
        {
            "content": "٧٥٦٣ - حَدَّثَنِي <a href=\"inr://man-415\">أَحْمَدُ بْنُ إِشْكَابٍ، </a>حَدَّثَنَا <a href=\"inr://man-5879\">مُحَمَّدُ بْنُ فُضَيْلٍ، </a>عَنْ <a href=\"inr://man-4642\">عُمَارَةَ بْنِ الْقَعْقَاعِ، </a>عَنْ <a href=\"inr://man-268\">أَبِي زُرْعَةَ، </a>عَنْ <a href=\"inr://man-3320\">أَبِي هُرَيْرَةَ </a>﵁ قَالَ: قَالَ النَّبِيُّ ﷺ: <hadeeth-2283>«كَلِمَتَانِ حَبِيبَتَانِ إِلَى الرَّحْمَنِ، خَفِيفَتَانِ عَلَى اللِّسَانِ، ثَقِيلَتَانِ فِي الْمِيزَانِ: سُبْحَانَ اللهِ وَبِحَمْدِهِ، سُبْحَانَ اللهِ الْعَظِيمِ.» <hadeeth>",
            "id": 11208,
            "number": "7563",
            "page": 162,
            "part": "9"
        }
    ],
    "shamelaId": 1681,
    "titles": []
}
