import { describe, expect, it } from 'bun:test';
import { type Page, segmentPages } from './index';

describe('bug', () => {
    let pages: Page[];

    const initPages = (contents: string[]) => {
        pages = contents.map((content, idx) => {
            return { content: content, id: idx };
        });
    };

    it('should handle extraction with trimming correctly', () => {
        const marker = 'SPLIT start';
        const filler = 'x'.repeat(2100);
        initPages([`${marker} intro ${filler}\n${marker} tail`, 'NEXT page content.']);

        const result = segmentPages(pages, {
            maxPages: 0,
            rules: [
                {
                    lineStartsWith: [marker],
                },
            ],
        });

        expect(result).toHaveLength(3);
        expect(result[0]?.from).toBe(0);
        expect(result[1]?.from).toBe(0);
        expect(result[2]?.from).toBe(1);
        expect(result[2]?.content).toStartWith('NEXT page');
    });

    it('should not merge pages', () => {
        pages = [
            {
                content:
                    '( من قام ليلتين لم يَمُتْ قلبه حين تموت القلوب ) ، هذا الحديث ضعيف فيه تدليس الوليد بن مسلم ، ولكن هل نقول أنه يُقبل لأنه في الترغيب ، ولأن الأصل جواز قيام الليل بدون استثناء ؟ وحديث عن العمل بالحديث الضعيف في فضائل الأعمال .\nالسائل : هنا سؤال : ( من قام ليلتين لم يَمُتْ قلبه حين تموت القلوب ) ، هذا الحديث ضعيف فيه تدليس الوليد بن مسلم ، ولكن هل نقول أنه يُقبل لأنه في الترغيب ، ولأن الأصل جواز قيام الليل بدون استثناء ؟\nالشيخ : شو لفظ الحديث ؟\nالسائل : ( من قام ليلتين لم يَمُتْ قلبه حين تموت القلوب ) .\nالشيخ : هل يجوز العمل به يقول السائل ؟\nالسائل : يقول هذا الحديث ضعيف ، فيه تدليس الوليد بن مسلم ، ولكن هل نقول أنه يُقبل لأنه في الترغيب ، ولأن الأصل جواز قيام الليل ؟\nالشيخ : هذا سؤال وهو محض مكرَّر تكلمنا عليه كثيرًا في مناسبات عديدة في هذه البلاد ، هذا الحديث من أسوأ الأحاديث الضعيفة التي تؤكِّد لنا القاعدة الصحيحة التي نتبنَّاها ؛ وهي أنه لا يجوز العمل بالحديث الضعيف في فضائل الأعمال ، والأدلة على ذلك كثيرة ، ولكني أقتصر الآن على شيء واحد يبيِّن تناقض هذه الجملة وتنافر أولها مع آخرها ، وآخرها مع أولها ؛ لأننا حين نقول : يُعمل بالحديث الضعيف في فضائل الأعمال إن كان المقصود نُثبت بهذا الحديث فضائل أعمال فهذا خلاف ما أجمع عليه علماء المسلمين كما نقل ذلك شيخ الإسلام ابن تيمية في " مجموعة الفتاوى " ، أما الحديث الضعيف لا يثبت به حكم شرعي ... الاستحباب ، وهذا مع ما ... بالحديث الضعيف في فضائل الأعمال ؛ أي : العمل ... فقدَّر ذلك أن يكون مستحبًّا ، فإذا كان المقصود بهذه الجملة يعمل بالحديث الضعيف في فضائل الأعمال ؛ أي : يثبت بالحديث الضعيف فضائل الأعمال هذا خلاف ما نشرنا آنفًا ونقرِّر ... ، وإذا كان المقصود غير هذا وهو المتبادر وهو الذي يُرجعه شيخ الإسلام بن تيمية وقال : إذا كان حديث من هذا النوع يمكن أن يُقال : يُعمل به في فضائل الأعمال ؛ أي : أن يكون فضل الأعمال ثبت بغير الحديث الضعيف ، وكل عبادة شرعية فلا شك أن لها فضيلة ، وإن كنا نحن نعرف فضيلتها بصورة إجمالية ؛ أي : كونها عبادة فلا شك أن الله - عز وجل - يُثيب القائم بها ويؤجره أجرًا كثيرًا .\nفإذا كان فضل عبادة ما قد ثبت بغير هذا الحديث فحينئذٍ لا يكون العمل بهذا الحديث ، وإنما يكون بما ثبت به شرعية تلك العبادة ، لكن قد تكون العبادة جاءت شرعيَّتها بحديث ثابت لكن ليس لهذا الحديث بيان فضيلة خاصة في ذلك العمل ؛ كما هو الشأن في هذا الحديث ؛ إيش فضيلة من أحياها يوم العيد ؟ قال : ( لم يَمُتْ قلبه يوم تموت القلوب ) ، هنا يلزمني أن نفترض أن السنة العملية جرت على إحياء ليلة العيد ، فقط عندنا من السنة العملية وإذا ثبت ذلك فمعناه أنها مشروعة ، جاء الحديث ممكن في هذه الحالة أن نقول : يُعمل به ؛ لأنه في فضائل الأعمال ، من أين عرفنا فضيلة هذا العمل ؟ ليس من هذا الحديث ، وإنما عرفنا - مثلًا - من حديث آخر ، لكن الواقع هنا وهذا من أخطاء الأحاديث الضعيفة أنها ... الأحاديث الضعيفة أدلة كما لو كانت أحاديث صحيحة يُثبت بها أعمال لم تكن ثابتة شرعيتها بغير هذه الأحاديث الضعيفة ، وهذا هو الحديث المثال بين أيدينا ، لم يكن من هدي الرسول - عليه السلام - أن يحيي ليلة العيد ، وبخاصة أن النبي - صلى الله عليه وسلم - لما حج حجة الوداع وأتى مزدلفة جَمَعَ ذلك الجمع المعروف جمع التأخير ثم ... ، ما أحيا ليلة العيد ! فكيف نقول الآن أن إحياء ليلة العيد فضيلة وليس عندنا إلا هذا الحديث الضعيف ؟\nإذًا لا يُعمل بالحديث بالضعيف ويعمل بالحديث بالضعيف ؛ ... الجملة هذه على وجهين ؛ لا يُعمل بالحديث بالضعيف في فضائل الأعمال إذا كان المقصود به تشريع عمل ما بالحديث الضعيف ؛ فلا يُعمل بالحديث بالضعيف في فضائل الأعمال ، أما إذا كان فضل الأعمال ثابتًا بغير هذا الحديث فيُرجى أن يكون هذا الحديث الذي فيه بيان فضيلة خاصة أن يكون عند الله - عز وجل - الأمر كذلك ، لكن ما ترتب عليه لا تشريع ما لم يكن شرعًا ولا عقيدة يجوز أن نبني على حديث ضعيف ، فإذًا وجود هذا الحديث من الناحية العملية وعدم وجوده سواء !\nوأنا أضرب على هذا مثالًا فيما يتحدَّث في هذا الموضوع حدث في السنة العملية أن النبي - صلى الله عليه وآله وسلم - كان إذا دخل المجلس حثا ثلاث حثوات من التراب فعاد ... إلى القبر ، جاء في حديث وائل أنه في الحثوة الأولى قال : (( منها خلقناكم )) ، في الثانية : : (( وفيها نعيدكم )) ، وفي الثالثة : (( ومنها نخرجكم تارةً أخرى )) .\nقال بعض العلماء الأفاضل من القدامى : هذا الحديث وان كان ضعيفًا لكن يُعمل بالحديث الضعيف في فضائل الأعمال ، انظروا الآن ؛ هذا معناه أسَّسنا كيفيَّة معينة في حثو هذه الحثيات الثلاث بتقسيم الآية الكريمة إلى ثلاثة أقسام ... ، وبهذه الكيفية من تلاوة الآية من فضائل الأعمال ، لذلك ... بالناس بالحديث الضعيف حكمًا شرعيًّا أقله الاستحباب ، ولذلك ... أن يقال لا يُعمل بالحديث الضعيف في فضائل الأعمال إلا إذا تصورنا الصورة السابقة حينئذٍ وقد رجعنا في النهاية إلى أن وجود الحديث الضعيف في هذه الصورة الأخيرة وعدمه سواء .\nثم لقد كانت هذه القاعدة في الحقيقة يعني مسوِّغة لكثرة البدع في الإسلام وبين علماء الإسلام الذين تبنَّوا هذه القاعدة ، بعض مَن ذهب إليها اشترط شروطًا هي دقيقة جدًّا ؛ فقد اشترطوا - مثلًا - : ألا يكون الضعف شديدًا ، وأن يكون الذي يعمل بالحديث على علم بضعفه ، وأن يدخل في قاعدة عامة ، ولكن عمليًّا لا أحد من هؤلاء أهل العلم يطبِّق هذه الأشياء ... ذلك لأنه مجرد أن يرى حديثًا فيه فضيلة أمر ما تشبَّث به دون أن يبحث هو صحيح ليعرف ويفرِّق بين ما ثبت في السنة وما لم يثبت في السنة .\nوكنا نجد نرى شيخًا يأتي بشيء ؛ يا شيخ من أين لك هذا ؟ يقول : في حديث في هذا . طيب ؛ ... يعمل في الحديث الضعيف في فضائل الأعمال ، بعد لأيٍ بعد ... بيقول لك : يعمل بالحديث الضعيف ولَّا لا يعمل ؟ لكن هو ما يدري هل هو صحيح ولَّا حديث هذا ضعيف ، ثم حينما لا يدري فمعناه أنه اختلط عليه الصحيح بالضعيف ، واختلط الحابل بالنابل كما يقال ؛ لذلك في الحقيقة التي ألمَسُها لمس اليد أن ستر الباب بقولنا : الحديث الضعيف يُعمل به في فضائل الأعمال لا سيَّما مع هذا الإطلاق الذي يفهمه عامة الناس كان خطرًا كبيرًا على المسلمين ، وكان فتح باب في الابتداع في الدين ، يُضاف إلى ذلك أن فضائل الأعمال الثابتة بالأحاديث الصحيحة ، وهذه الأعمال الكثيرة أكثر الناس لا يستطيعون أن يعملوا بها ، فهم حسبهم أن يعملوا ببعضها ؛ فليسوا بحاجة إلى أن يزدادوا حملًا آخر على ما صحَّ عن الرسول - عليه السلام - .\nطيب غيره إيش في ؟',
                id: 141937,
            },
            {
                content:
                    'شيخ الإسلام حينما يقول : إن مقصود الإمام أحمد والأئمة الآخرون بالحديث الضعيف هو الحديث الحسن ؛ فهل واجهكم هذا القول من قبل ؟\nالسائل : شيخ الإسلام ابن تيمية حينما يقول : مقصود الإمام أحمد والأئمة الآخرون بالحديث الضعيف هو الحديث الحسن ... الحديث الضعيف ... ، ما أدري يعني واجهك هذا القول ؟\nالشيخ : والله نحن ما عندنا إلا ما نقله ابن تيمية - رحمه الله - ، ... إذا سمعتم رأينا في موضوع الحديث الضعيف الذي يُعمل به في فضائل الأعمال ، وسمعتم ما نقلته آنفًا عن شيخ الإسلام أنه لا يجوز أن يُشرِّع الإنسان لحديث ضعيف حتى خبرًا مستحبًّا فقط ، ونقل الإجماع كما ذكرنا آنفًا ؛ فليس من المعقول أن الإمام أحمد إمام السنة أن يستدلَّ بالحديث الضعيف في الأحكام الشرعية كلها ، ولما كان هذا اللفظ أن الحديث الضعيف يستدل به الإمام أحمد لا يمكن أن يلتقي مع الإجماع الذي أثاره بالدليل نفسه فهو ... نحن معه في هذا ... نفس التأويل وهو معقول جدًّا ؛ لأن تقسيم الحديث إلى ثلاثة أقسام : صحيح ، وحسن ، وضعيف ؛ هذا لم يكن معروفًا في ... علم المصطلح يُحرَّف القول فيه ، وإنما كان تقسيمهم إلى صحيح وضعيف ، فإذا جاء في لفظ الإمام أحمد بأنه يجوز العمل بالحديث الضعيف في الأحكام ؛ فإنما يعني بذلك الحديث الحسن الذي يُحتجُّ به عند جماهير علماء الحديث ، فما في عنَّا إلا هذا التأويل حتى يلتقي مع ... .',
                id: 141938,
            },
            {
                content:
                    'هناك ردود على الداعية محمد الغزالي المصري ، هل ترى أن هذه الرُّدود هي الطريقة السليمة في النصح والإرشاد ؟ وهل ردَدْتم على الغزالي ؟\nالسائل : طيب يا شيخ سؤال ... .\nالشيخ : وهو ؟\nالسائل : فضيلة الشيخ ، ... إعلان الناظري كتاب الغزالي ؛ حيث قام بعض المشايخ وطلبة العلم بالرَّدِّ على هذا الكاتب وكتابه ... بين الغزالي ومن ردَّ عليه ، وذلك عن طريق ردوده عليهم ؛ هل ترى أن هذه الرُّدود هي الطريقة السليمة في النصح والإرشاد ؟ وهل ردَّ الشيخ على الغزالي ؟\nالشيخ : أما أنا فما ردَدْتُ عليه ، ولا أنا أشغل نفسي في الرَّدِّ عليه وعلى أمثاله ، أما الرد عليه فهو أمر واجب ، والناس يختلفون حتمًا بأساليب الرَّدِّ على المخالفين وعلى المنحرفين ؛ فمنهم المعتدل ، ومنهم المتساهل جدًّا ، ومنهم المتشدد ، و ... هو الوسط كما هو معلوم في كل الأمور ، أما السكوت عن هذا الكتاب فلا شكَّ أنه لا يجوز ، ويجب على مَن كان عنده قدرة علمية و ... أن يُجمع أمره وأن يردَّ عليه ردًّا تفصيليًّا ؛ لأن الرجل لا هو عالم بالحديث ولا عالم بالفقه خلاف ما يدَّعي هو أو مَن يغترُّ بمعسول كلامه ، فالرد واجب ، ولكن كما قال - تعالى - : (( ادع إلى سبيل ربك الحكمة والموعظة الحسنة وجادلهم بالتي هي أحسن )) ، ولكن ربنا - عز وجل - من رأفته لعباده أنه لم يضيِّق عليهم ، فقال في بعض الأحوال : (( فمن اعتدى عليكم فاعتدوا عليه بمثل ما اعتدى عليكم )) ، وهو بلا شك لم يتكلَّم ببيان الصواب من الخطأ لبعض المشايخ ، وإنما اتَّهم جماهير المهتمِّين بالسنة ، ورماهم بألفاظ لا يليق من كاتب إسلامي أو داعية إسلامي كما يقولون اليوم أن يتلفَّظ بتلك الألفاظ ، فإن بدر من بعض الرَّادِّين عليه شيء من القسوة في نفس المواطن التي هو قسا فيها على أهل السنة فهذا يكون جائزًا ، وإن كان الأصل أن ينشد الإنسان بطريقة علمية ، وأن يبيِّنَ الحق ولا ينفد وقته لأن يثأر لنفسه ، وإن كان هذا الثأر جائزًا فيما إذا وُضِعَ في محلِّه ، هذا ما نقوله الآن .',
                id: 141939,
            },
            {
                content:
                    'هل يجوز للمرأة أن تقصِّر شعر رأسها إذا كان يتساقط ؟\nالسائل : فضيلة الشيخ هل يجوز للمرأة أن تقصِّر شعر رأسها إذا كان يتساقط ؟\nالشيخ : أن تقصِّر من شعرها إذا كان يتساقط ، كأن المقصود يعني أن ينقصَّ يجعله لا يتساقط ولَّا إيه ؟\nالسائل : في بعض الشعور إذا ... تتساقط .\nسائل آخر : تمشيط يعني ولَّا لأ ؟\nالسائل : ... .\nالشيخ : ... ما وراء الأكمة ما وراءها ، صيغة السؤال ... أنا بقول في " صحيح مسلم " : أن نساء النبي - صلى الله عليه وآله وسلم - كنَّ يأخذْنَ من شعورهنَّ حتى تكون كالوفرة " ، لكن أنا في الحقيقة ما فهمت ما وراء السؤال ، وإلا لو كان السؤال هكذا صريحًا وهذا يقع في هذه الأيام الأخيرة وأنا في هذه البلاد أكثر من مرة : هل يجوز للمرأة أن تقصَّ من شعرها أو تقصِّر شعرها ؟\nالجواب : يجوز ولا يجوز ؛ إن كان الحنفي انتهى على القصِّ هو التشبه بالغلمان أو بالكافرات أو بالفاسقات فلا يجوز ، أما إن كان القصُّ الحامل عليه هو تخفيف الشعر من إيش ؟ كثرة الحمَّام والفرك و ... .\nالسائل : ...\nالشيخ : نعم ؟\nالسائل : ... .\nالشيخ : فهذا يجوز بلا شك ، ... من المنهيَّات لأنُّو هذا عمل جائز ، فإذا دخلت نية اعتداء أفسدته ، وإن كانت النية جائزة فهو جائز ، لكن السؤال أنا ما عرفت يعني إيش كان المقصود منه ؟',
                id: 141940,
            },
            {
                content:
                    'في قوله - صلى الله عليه وسلم - : ( صلاة الخوف ركعة ) .\nالشيخ : إذا أردنا يأتي عندنا صورة موضِّحة من السنة العملية جوابًا عن هذا السؤال ، لكن إذا تأملنا قوله - عليه السلام - : ( صلاة الخوف ركعة ) رواه الإمام مسلم في " صحيحه " فيمكن أن نعتمد عليه ونجعل المغرب ركعة واحدة ، لكن ما فينا نقول أنه سنة ... يحدد الجواب بصورة قاطعة ، على كل حال هذا الجواب جواب ... والذي لا أستحضر الآن ... .',
                id: 141941,
            },
            {
                content:
                    'مسألة نفي الحركة والانتقال في النزول وفي المجيء لله - عز وجل - ؟ وسؤال عن كتب الشيخ ، وعن بعض الرواة .\nالسائل : مسألة نفي الحركة والانتقال في النزول وفي المجيء لله - عز وجل - ؟\nالشيخ : ... .\nالسائل : يقول يجيء .\nالشيخ : يجيء وينزل كما يشاء ، كما يجيء ... ، أما لفظ لم يَرِدْ فلا نستعمله ؛ كما يقول ابن تيمية في لفظة الجهة : لا ننفيها ولا نثبتها ؛ لأن كل من في النفي والاثبات محذور .\nالسائل : لكن من قال أن الله - عز وجل - ينزل ، أو نزوله مُنزَّه عن الحركة والانتقال ؟\nالشيخ : أنا أقول ... جوابك هذا لا نقول لا سلبًا ولا إيجابًا ، لا نفيًا ولا إثباتًا .\nالسائل : ومن قال بهذا ؟\nالشيخ : يؤثم .\nالسائل : وللبيهقي في كثير من تصانيفه عندما تعرَّض لأحاديث النزول ... .\nالشيخ : في عنده أشعرية ، هو من أئمة الحديث والسنة ، لكن في عنده بقايا لعلك تعرف هذا ولَّا تستغربه ؟\nالسائل : لأ ، شيخنا أبو بكر بن فورك .\nالشيخ : ... هو أشعري .\nالسائل : طيب يا شيخ ، الآن كم اللي يتوقَّع أن يخرج منها ؟\nالشيخ : 12 مجلد .\nالسائل : معناها قريبة الخروج ؟\nالشيخ : والله ببطء ، لأنُّو ما في عندنا الاستعداد الوقتي ولا الطبعي ، الآن نحن نطبع الخامسة من الضعيفة والخامسة من الصحيحة ، ونعيد طباعة المجلد الأول ... إعادة ، فيها طبعًا بحوث جديدة ، فيها مقدمة طويلة ... ، في رسالته التي حاول أن يصحِّح .\nالسائل : هذا أهو إسماعيل ؟\nالشيخ : هو إسماعيل ... .\nالسائل : أقول مع الأسف يعني !\nالشيخ : هذا حاقد ... .\nالسائل : نعم .\nالشيخ : ... .\nالسائل : ولم أَرَ أحد من أهل السنة يقرِّب المبتدعة ويرد على أهل السنة في هذه الحرارة وهو ... .\nالشيخ : إي نعم .\nالسائل : أهل السنة يعني لا ، ويحاول أن يؤثِّر على طلبة العلم ، لكن الحمد لله .\nالشيخ : الله المستعان ... ، ورواية الليث نفصِّل .\nالسائل : أنا ما أستطيع التوفيق بينهما ، ولكن أقول إنها عذر للإمام مسلم في إخراج رواية أبي الزبير عن جابر .\nالشيخ : أنا أوجدت عذرًا قد يكون أقرب صحة من هذا العذر ؛ لأننا لا نعلم أن مسلمًا كان يعتبر أن أبا الزبير مدلس ، فكون ابن حبان وغيره يصرِّح بأن أبا الزبير مدلس لا يجب أن يكون كذلك عند مسلم ، وهم أكثر به ... ، وهو بناءً على ذلك روى له ، فهو لا يحتاج إلى أن يفعل أو ... لأننا ندافع عن الشيء بمثله ، أما في روايته هذه بعد أن نتثبَّت من صحة خروجها إلى أبي الزبير فحينئذٍ نقول : رواية الزبير مفصِّلة ومبيِّنة ، فهي تطغي على رواية المغيرة ، وهذا أنا أقوله قبل أن أطَّلع عليها ، وأنا ... المصلحة ، وسنرى كيف نفس هذه الرواية ... أنها تعطي أن أبا الزبير كل الأحاديث التي يرويها عن جابر قد سمعها منه ، فيجب التثبت من شيئين اثنين ؛ أولها هذا ، وهو دلالة النَّصِّ على هذا المعنى ، الشيء الآخر : التأكد من صحة الرواية هذه عن أبي الزبير ، وهذا ما سنمرُّ فيه - إن شاء الله - .\nالسائل : جاء في الجمعة في " صحيح مسلم " .\nالشيخ : معلول من ... على أبي موسى الأشعري ، ومعلول بالشذوذ أو النكارة لمخالفته الأحاديث التي تُعيِّن أن بعد العرش ... .\nالسائل : ومخرمة بن بكير - أيضًا - لم يسمع من أبيه ؟\nالشيخ : إي نعم ، لكن هذا له بعض التأويلات ؛ كان ينقل من كتب أبيه ولم يسمع الكتاب منه ، هذا يعتبر رواية وجادة ؛ لأنه لا يتصور في ولد أن ينقل عن كتاب أبيه إلا وهو يعرفه .\nالسائل : وأظن - يا شيخ - جمهور من رووه عن أبي بردة موقوفًا على أبي بردة نفسه .\nالشيخ : لا شك ولا ريب .\nالسائل : وليس على ... .\nالشيخ : ... رووه موقوفًا على أبي بردة ، ليس على أبي بردة فقط .\nالسائل : رووه موقوفًا على أبي بردة ، لكن أشهر الرواة ... الأحدب ، ومجموعة من الرواة أبو إسحاق السبيعي رووه عن أبي بردة من قوله .\nالشيخ : هذا ممكن ؛ أنه رُوِيَ عن أبي موسى موقوفًا فهو موجود ، أما أنُّو تقول أنت : الروايات في وقف الحديث على أبي بردة ... هذا ممكن .\n... ... ...',
                id: 141942,
            },
            {
                content:
                    'حديث النبي - صلى الله عليه وسلم - أنه مسح على خُفَّيه ، ثم نزع الخفَّ وصلى ؟\nالسائل : حديث أن النبي - صلى الله عليه وسلم - مسح على خُفَّيه ، ثم نزع الخفَّ فصلَّى ؟\nالشيخ : من وين هذا الحديث ؟\nالسائل : حدَّثنا به أحد الإخوان يعني أنكم حسَّنتم هذا الحديث ، وهو من رواية البيهقي .\nالشيخ : أنا ما أذكر الآن شيئًا مرفوعًا ، إنما اللي أذكره دائمًا إنما هو حديث أثر علي : " أنه توضَّأ ومسحَ على نعليه ، ثم أتى المسجد فخلعهما ، وصلى بالناس إمامًا " ، هذا صحيح عنه ، أما الحديث المرفوع أنا لا أذكره الآن .\nالسائل : يا شيخ ، قياس خلع الخفِّ على حلق الرأس في انتهاء المدَّة والمسح ؟\nالشيخ : هذا ليس قياسًا ، بعد مجيء النص ما فائدة هذا القياس ؟ وإنما هو التقريب ؛ تقريب مسألة بأخرى .',

                id: 141943,
            },
            {
                content:
                    'مسألة رفع الصوت بالأذكار بعد الصلاة ؟\nالسائل : مسألة رفع الصوت بالأذكار بعد الصلاة ؟\nالشيخ : الذي نراه ... التعليم ، كان رفع الصوت بعد الصلاة يتنافى مع أصول من الشريعة التي تنصُّ على أنه لا يجوز التشويش على المصلين ، تعلية الصوت فيه تشويش على مَن قد يكون في المسجد من المسبوقين ، وفيه تشويش على مَن يريد أن يذكر الله لوحده وليس ذكرًا جماعيًّا كما يفعلون في بعض المساجد كما في سوريا وغيرها ، فأنت - مثلًا - تريد أن تقول : الله أكبر الله أكبر ، أنا أريد أن أقول : أستغفر الله أستغفر الله ، فلماذا تشوِّش عليَّ وأشوش عليك ؟ أو لماذا تفرض عليَّ أن أمشي معك في التكبير ولا أفرض عليك أن تمشي معي بالاستغفار ؟ ... أستغفر الله أستغفر الله ، الله أكبر الله أكبر ، ليس في هذا التذكير بخاصَّة ذكر المكان بصورة محددة ... في بعض الأحاديث التي جاءت فحديث الاستغفار هو أول ما يقوله الإنسان ؛ لأنه إذا ... سلَّم استغفر ثلاثًا ، أما ذاك ... رفع الصوت بالتكبير ، ... هو هذا الحديث ... ؛ فلذلك فلو أن المصلي استغفر الله ثلاثًا ، ثم قال : أستغفر الله أستغفر الله ثلاثًا ، ثم قال : اللهم ... لا إله إلا الله وحده لا شريك له إلى آخره ... فإذًا هنا لا ترتيب بين هذه الأذكار ، فالمصلُّون ... يأتون بهذه الأوراد كيفما شاؤوا ، فإذا قيل بسنية رفع الصوت بالتكبير خطأ بلا شك ، فيه تشويش على سائر المصلين ، ... ليس بالحديث الذي ينهى به عن ( لا يشوِّش قارئكم على مصلِّيكم ) هذا لا أصل له ، ولكن المنهي عنه كما في " موطأ مالك " و " سنن أبي داود " حديث أبي سعيد الخدري أن النبي - صلى الله عليه وآله وسلم - لم يعد ... كشف الستارة قال : ( يا أيها الناس ، لا يجهر بعضكم على بعض بالقراءة ) ، برواية ... زاد البغوي وغيره بسند قوي : ( فتؤذوا المؤمنين ) ، هو في الجهر بالتكبير ... الإمام الشافعي ... بأنه كان ... التعليل ، فالتعبير يبرِّر رفع الصوت ولا بد ، أما أن يُتَّخذ الجهر سنة كما هو شأن في الصلوات الجهرية فلا دليل على ذلك .',
                id: 141944,
            },
        ];

        pages.push({
            content:
                'حديث : ( إن أحدكم إذا قام إلى الصلاة فإنه يناجي ربه ؛ فلا يجهر بعضكم على بعض بالقراءة ) ، والحديث الآخر : ( خير الذِّكر الخفي ) ؟\nالسائل : يا شيخ ، حديث : ( إن أحدكم إذا قام إلى الصلاة فإنه يناجي ربه ؛ فلا يجهر بعضكم على بعض بالقراءة ... ) ، والحديث الآخر : ( خير الذِّكر الخفي ) ؟\nالشيخ : هذا فيه ضعف ، لكن المعنى صحيح .\nالسائل : ... أن الجهر بالبسملة من باب التعليم ؟\nالشيخ : من باب إيش ؟\nالسائل : من باب التعليم .\nالشيخ : التعليم ؟\nالسائل : إي نعم .\nالشيخ : هذا نقوله لو ثبتت ، لكن ما ثبتت .\nالسائل : حديث أبي هريرة ؟\nالشيخ : لا ليس فيه الجهر .\nالسائل : جهر باسم الله قال : " إني لَأشبَهُكم بصلاة رسول الله - صلى الله عليه وسلم - وجهر ... .',
            id: 141945,
        });

        const segments = segmentPages(pages, {
            // logger: console,
            maxPages: 0,
            rules: [
                {
                    lineStartsWith: ['طيب', 'لأن', 'لكن', 'هذا', 'هذه', 'بل '],
                },
            ],
        });

        console.log(segments);
    });

    it('integration', async () => {
        const data = await Bun.file('book.json').json();
        pages = data.pages.map((p: { body: string; page: number }) => ({ content: p.body, id: p.page }));

        const segments = segmentPages(pages, {
            breakpoints: [
                '{{tarqim}}',
                '{{newline}}',
                '،',
                {
                    words: [
                        'وكذلك ',
                        'فهذا ',
                        'ثم ',
                        'ثانيا',
                        'وثانيا',
                        'أقول',
                        'كذلك ',
                        'سبحان الله',
                        'وقد ',
                        'وقال ',
                        'ولكن ',
                        'فليس ',
                        'فلما ',
                        'لكنه ',
                        'ففي هذا ',
                        'لكن ',
                        'أما ',
                        'وإنما ',
                        'فنحن ',
                        'لأنّ ',
                        'فإذا ',
                        'كما قال ',
                        'قال ',
                        'وليس ',
                        'بل ',
                        'حتى ',
                        'حتّى ',
                        'لهذا ',
                    ],
                },
                '',
            ],
            maxContentLength: 2000,
            maxPages: 0,
            preprocess: ['removeZeroWidth', 'fixTrailingWaw', 'condenseEllipsis'],
            rules: [
                {
                    lineStartsWith: [
                        '{{basmalah}}',
                        'الثالثة',
                        'الخلاصة',
                        'والثاني',
                        'الأولى',
                        'الثاني',
                        'الخامس',
                        'الشاهد',
                        'فخلاصة',
                        'وثانيا',
                        'وخلاصة',
                        'اللهم',
                        'ثالثا',
                        'ثالثة',
                        'ثانيا',
                        'خلاصة',
                        'فأولا',
                        'فماذا',
                        'لماذا',
                        'وإنما',
                        'ولهذا',
                        'أقول',
                        'أولا',
                        'فنحن',
                        'لهذا',
                        'نسأل',
                        'وأنا',
                        'ونحن',
                        'أما',
                        'أول ',
                        'روى',
                        'طيب',
                        'لأن',
                        'لكن',
                        'هذا',
                        'هذه',
                        'بل ',
                    ],
                },
            ],
        });

        await Bun.write('segments.json', JSON.stringify(segments, null, 2));
    });
});
