import { describe, it } from 'bun:test';
import { segmentPages } from './index';

describe('bug', () => {
    it('should not merge the pages', async () => {
        const pages = [
            {
                body: 'سؤال في الوصيَّة : رجل أوصى وهو في حياته بثلث الميراث لزوجته  أخذوا شققًا في المنزل ؛ ولذا قرَّر وصيته ؛ هل يجوز ذلك تأمين لأولاده الصغار أم لا ؟ وجزاكم  موصٍ بخلاف وصية النبي - صلى الله عليه آله وسلم - فهي  في السؤال المذكور .\nونسأل الله - عز وجل - أن يهيِّئنا لأن نسلِّمَ أنفسنا لأحكام شريعتنا لا نفرِّق بين ما كان منها في الكتاب أو ما جاء في السنة الصحيحة .\nنعم .',
                page: 141837,
            },
            {
                body: 'امرأة تسأل عن والدها المُتوفى الذي في ذمَّته رقبتين ، مات في حادث سيارة ولم يحرِّر رقبة أو يصم شهرين متتابعين لجهلهم في هذا الأمر ؛ مع العلم أنه دفع ديتهم ، فهل لي أن أصوم شهرين عن كلِّ نفس ؟ وهل يمكن أن أتقاسمها مع أقاربي ؟ وهل يمكن إطعام ستين مسكين عن كل نفس ؟\nالسائل : فضيلة الشيخ ، السلام عليكم ورحمة الله وبركاته ، وحياكم الله ، أما بعد :\nامرأة تسأل عن والدها المُتوفى الذي في ذمَّته رقبتين ، مات في حادث سيارة ولم يحرِّر رقبة أو يصم شهرين متتابعين لجهلهم في هذا الأمر ؛ مع العلم أنه دفع ديتهم ، فهل لي أن أصوم شهرين عن كلِّ نفس ؟ وهل يمكن أن أتقاسمها مع  - تعالى - .',
                page: 141838,
            },
        ].map((p) => ({ content: p.body, id: p.page }));

        const segments = segmentPages(pages, {
            breakpoints: [''],
            logger: console,
            maxPages: 0,
        } as any);
        //expect(segments).toHaveLength(2);

        //await Bun.write('segments.json', JSON.stringify(segments, null, 2));

        console.log(segments);
    });
});
